Project/Toir/src/InformationRegisters/гкс_СоответствияДолжностейИКвалификаций/гкс_СоответствияДолжностейИКвалификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СоответствияДолжностейИКвалификаций</name>
  <comment>TOIR20-181</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Квалификация</name>
    <type>
      <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/гкс_ВидыОперацииВводДанныхПоТрудовымРесурсам/гкс_ВидыОперацииВводДанныхПоТрудовымРесурсам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ВидыОперацииВводДанныхПоТрудовымРесурсам</name>
  <enumValues>
    <name>ВводДанных</name>
  </enumValues>
  <enumValues>
    <name>Корректировка</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Enums/гкс_ВидДвижения/гкс_ВидДвижения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ВидДвижения</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Documents/гкс_ВводДанныхПоТрудовымРесурсам/гкс_ВводДанныхПоТрудовымРесурсам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_ВводДанныхПоТрудовымРесурсам</name>
  <comment>TOIR20-172</comment>
  <registerRecords>AccumulationRegister.гкс_ТрудовыеРесурсы</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.гкс_ВидыОперацииВводДанныхПоТрудовымРесурсам</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Трудозатраты</name>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.гкс_ВидДвижения</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодПланирования</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Доступно</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Запланировано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/Catalogs/гкс_ПроизвольныеНастройкиИнтеграций/гкс_ПроизвольныеНастройкиИнтеграций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гкс_ПроизвольныеНастройкиИнтеграций</name>
  <predefined>
    <items>
      <name>ЗагрузкаИзЗУП</name>
      <description>Загрузка из ЗУП</description>
    </items>
    <items>
      <name>СтатусыЗаявокКВыгрузке</name>
      <description>Статусы заявок к выгрузке</description>
    </items>
    <items>
      <name>НеПереноситьДляТестирования</name>
      <description>Не переносить (Элемент для тестирования)</description>
    </items>
  </predefined>
  <attributes>
    <name>ДопСвойства</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Свойства</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <comment>Организации</comment>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Catalogs/СтруктураПредприятия/СтруктураПредприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураПредприятия</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ТекущийРуководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетСтруктуреЮридическихЛиц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Организация</name>
    <comment>TOIR20-580</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/CommonModules/гкс_ПолучениеДанныхОДоступностиТрудовыхРесурсов/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// гкс_ПолучениеДанныхОДоступностиТрудовыхРесурсов: получение данных о плановых рабочих часах сотрудников из баз ЗУП
//	на будущие периоды
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура гкс_ПолучениеДанныхОДоступностиТрудовыхРесурсов() Экспорт
	
	НастройкаИнтеграции = ПредопределенноеЗначение("Справочник.гкс_ПроизвольныеНастройкиИнтеграций.ЗагрузкаИзЗУП");
	Настройки = Справочники.гкс_ПроизвольныеНастройкиИнтеграций.ПолучитьСвойства(НастройкаИнтеграции, "Все");
	Если Не ТипЗнч(Настройки.ДопСвойства) = Тип("ТаблицаЗначений") Тогда 
		Возврат;		
	КонецЕсли; 
	
	Для каждого Настройка Из Настройки.ДопСвойства Цикл
		
		НачалоЗапроса = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		Запрос = СформироватьТекстЗапроса(Настройка);
		ОтветТекст = ВыполнитьЗапросКЗУП(Запрос, Настройки.Свойства);
		ОбработатьОтвет(ОтветТекст);
		
		ДобавитьЗапросВЛог(Запрос, Настройки.Свойства, ОтветТекст, НачалоЗапроса);		
		
	КонецЦикла; 
	
КонецПроцедуры

Функция СформироватьТекстЗапроса(Настройка)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", Настройка.Организация);
	Отбор.Вставить("ЦФО", Настройка.Подразделение);
	Отбор.Вставить("ДатаС", Настройка.ДатаС);
	Отбор.Вставить("ДатаПо", Настройка.ДатаПо);
	
	ОтборXDTO	= ПолучитьОтборXDTO(Отбор);
	
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку("UTF-8");
	Запись.ЗаписатьОбъявлениеXML();

	ФабрикаXDTO.ЗаписатьXML(Запись, ОтборXDTO, , , , НазначениеТипаXML.Явное);
	
	ТекстСообщения = Запись.Закрыть();
	
	Возврат ТекстСообщения;	
	
КонецФункции
 
Функция ВыполнитьЗапросКЗУП(Запрос, Настройка) Экспорт
	
	СтруктураВозврата	= Новый Структура("ВыполненоУспешно, Идентификатор", Истина, "");

	Попытка 
		Клиент = ОчередьСообщений.НовыйКлиентАсинхронногоСервиса(Настройка["Очередь"]);
		НомерСообщения = Клиент.Вызвать(Настройка["Метод"], Новый Структура("Сообщение", Запрос));										
		ТаймаутПоУмолчанию = 30000;
		Таймаут = ?(Настройка["Таймаут"] = Неопределено, ТаймаутПоУмолчанию, Настройка["Таймаут"]);		
		Ответ = Клиент.ОжидатьОтвет(Таймаут);                              	
	Исключение
		Ответ	= "";
		СтруктураВозврата.ВыполненоУспешно	= Ложь;
		ЗаписьЖурналаРегистрации("ЗапросДанныхТрудозатрат",
									УровеньЖурналаРегистрации.Ошибка, 
									, 
									, 
									ОписаниеОшибки());
	КонецПопытки;
	
	Если  ТипЗнч(Ответ) = Тип("ФиксированнаяСтруктура") Тогда                         	
		ОтветТекст = Ответ.result.value;
	Иначе
		СтруктураВозврата.ВыполненоУспешно = Ложь;			
	КонецЕсли;
		
	Возврат ОтветТекст;
	
КонецФункции

Процедура ОбработатьОтвет(ОтветТекст) Экспорт
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ОтветТекст);
	ЧтениеXML.ПерейтиКСодержимому();
	Ответ = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	Если Не Ответ.Установлено("Row") Тогда
		Возврат;
	КонецЕсли; 
	СоответствиеНаименованийСвойств = ПолучитьСоответствиеНаименованийСвойств();
	
	ТЗДляЗаполнения = ПолучитьТЗДляЗаполнения();
	ТЗ = СписокXDTOВТаблицуЗначений(Ответ.Row, СоответствиеНаименованийСвойств, ТЗДляЗаполнения);
	ЗаписатьДанныеВДокумент(ТЗ);
	
КонецПроцедуры 

Функция ПолучитьСоответствиеНаименованийСвойств()
	
	СоответствиеНаименованийСвойств = Новый Соответствие;
	СоответствиеНаименованийСвойств.Вставить("Company", 		"Организация");
	СоответствиеНаименованийСвойств.Вставить("CostCenter", 		"Подразделение");
	СоответствиеНаименованийСвойств.Вставить("JobTitle", 		"Должность");
	СоответствиеНаименованийСвойств.Вставить("Date", 			"ПериодПланирования");
	СоответствиеНаименованийСвойств.Вставить("WorkersCount", 	"КоличествоСотрудников");
	СоответствиеНаименованийСвойств.Вставить("WorkingHours", 	"Часы");
	
	СоответствиеНаименованийСвойств.Вставить("Организация", 			"Company");
	СоответствиеНаименованийСвойств.Вставить("Подразделение", 			"CostCenter");
	СоответствиеНаименованийСвойств.Вставить("Должность", 				"JobTitle");
	СоответствиеНаименованийСвойств.Вставить("ПериодПланирования", 		"Date");
	СоответствиеНаименованийСвойств.Вставить("КоличествоСотрудников", 	"WorkersCount");
	СоответствиеНаименованийСвойств.Вставить("Часы", 					"WorkingHours");
	
	Возврат СоответствиеНаименованийСвойств;
		
КонецФункции

Процедура ЗаписатьДанныеВДокумент(ТЗ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаСДанными", ТЗ);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаСДанными.Организация КАК Организация,
		|	ТаблицаСДанными.Подразделение КАК Подразделение,
		|	ТаблицаСДанными.Должность КАК Должность,
		|	ТаблицаСДанными.ПериодПланирования КАК ПериодПланирования,
		|	ТаблицаСДанными.КоличествоСотрудников КАК КоличествоСотрудников,
		|	ТаблицаСДанными.Часы КАК Часы
		|ПОМЕСТИТЬ ВТ_ТаблицаСДанными
		|ИЗ
		|	&ТаблицаСДанными КАК ТаблицаСДанными
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	гкс_СоответствияДолжностейИКвалификацийСрезПоследних.Организация КАК Организация,
		|	гкс_СоответствияДолжностейИКвалификацийСрезПоследних.Подразделение КАК Подразделение,
		|	гкс_СоответствияДолжностейИКвалификацийСрезПоследних.Должность КАК Должность,
		|	гкс_СоответствияДолжностейИКвалификацийСрезПоследних.Квалификация КАК Квалификация
		|ПОМЕСТИТЬ КвалификацииДолжностей
		|ИЗ
		|	РегистрСведений.гкс_СоответствияДолжностейИКвалификаций.СрезПоследних(
		|			,
		|			(Организация, Подразделение, Должность) В
		|				(ВЫБРАТЬ
		|					ВТ_ТаблицаСДанными.Организация КАК Организация,
		|					ВТ_ТаблицаСДанными.Подразделение КАК Подразделение,
		|					ВТ_ТаблицаСДанными.Должность КАК Должность
		|				ИЗ
		|					ВТ_ТаблицаСДанными КАК ВТ_ТаблицаСДанными
		|				СГРУППИРОВАТЬ ПО
		|					ВТ_ТаблицаСДанными.Подразделение,
		|					ВТ_ТаблицаСДанными.Должность,
		|					ВТ_ТаблицаСДанными.Организация)) КАК гкс_СоответствияДолжностейИКвалификацийСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаСДанными.Организация КАК Организация,
		|	ВТ_ТаблицаСДанными.Подразделение КАК Подразделение,
		|	ВТ_ТаблицаСДанными.Должность КАК Должность,
		|	ВТ_ТаблицаСДанными.ПериодПланирования КАК ПериодПланирования,
		|	ВТ_ТаблицаСДанными.КоличествоСотрудников КАК КоличествоСотрудников,
		|	ВТ_ТаблицаСДанными.Часы КАК Доступно,
		|	КвалификацииДолжностей.Квалификация КАК Квалификация
		|ИЗ
		|	ВТ_ТаблицаСДанными КАК ВТ_ТаблицаСДанными
		|		ЛЕВОЕ СОЕДИНЕНИЕ КвалификацииДолжностей КАК КвалификацииДолжностей
		|		ПО ВТ_ТаблицаСДанными.Организация = КвалификацииДолжностей.Организация
		|			И ВТ_ТаблицаСДанными.Подразделение = КвалификацииДолжностей.Подразделение
		|			И ВТ_ТаблицаСДанными.Должность = КвалификацииДолжностей.Должность
		|ИТОГИ ПО
		|	Организация";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОрганизация = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаОрганизация.Следующий() Цикл
		НовыйДокумент = Документы.гкс_ВводДанныхПоТрудовымРесурсам.СоздатьДокумент();		
		НовыйДокумент.Дата = ТекущаяДатаСеанса();
		НовыйДокумент.ВидОперации = Перечисления.гкс_ВидыОперацииВводДанныхПоТрудовымРесурсам.ВводДанных;
		НовыйДокумент.Организация = ВыборкаОрганизация.Организация;
		НовыйДокумент.Комментарий = "Создано регламентным заданием, данными из ЗУП";
		НовыйДокумент.Ответственный = Пользователи.ТекущийПользователь();
		
		Выборка = ВыборкаОрганизация.Выбрать();	
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = НовыйДокумент.Трудозатраты.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка); 
			НоваяСтрока.ВидДвижения = Перечисления.гкс_ВидДвижения.Приход;
		КонецЦикла;
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
		
КонецПроцедуры

Функция ПолучитьОтборXDTO(Отбор)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Менеджер = гкс_ОбщегоНазначения.ОбщийМодуль("Обработки.гкс_ОбработчикСообщенийАсинхронногоСервиса");	
	
	ОбъектXDTO = Менеджер.СоздатьОбъект("ASWorkForceAvailabilityRequest", 
										Метаданные.ПакетыXDTO.гкс_AsynxExchangeServices.ПространствоИмен);
										
	ДанныеОбъекта = Новый Структура;
	ДанныеОбъекта.Вставить("Company", Отбор.Организация);
	ДанныеОбъекта.Вставить("CostCenter", Отбор.ЦФО);
	ДанныеОбъекта.Вставить("DateFrom", Отбор.ДатаС);
	ДанныеОбъекта.Вставить("DateTo", Отбор.ДатаПо);

	ЗаполнитьЗначенияСвойствXDTO(ОбъектXDTO, ДанныеОбъекта);
	
	Возврат ОбъектXDTO;
	
КонецФункции

Функция ПолучитьТЗДляЗаполнения()
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТЗ.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	ТЗ.Колонки.Добавить("Должность", Новый ОписаниеТипов("СправочникСсылка.Должности"));
	ТЗ.Колонки.Добавить("ПериодПланирования", Новый ОписаниеТипов("Дата"));
	ТЗ.Колонки.Добавить("КоличествоСотрудников", Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("Часы", Новый ОписаниеТипов("Число"));

	Возврат ТЗ;

КонецФункции

Функция СписокXDTOВТаблицуЗначений(СписокXDTO, СоответствиеНаименованийСвойств = Неопределено,  ТЗ = Неопределено)
	
	Если ТЗ = Неопределено И СписокXDTO.Количество() > 0 Тогда
		ТЗ = Новый ТаблицаЗначений;
		Для Каждого Свойство Из СписокXDTO[0].Свойства() Цикл
			Если СоответствиеНаименованийСвойств = Неопределено Тогда
				ТЗ.Колонки.Добавить(Свойство.Имя);
			Иначе
				ТЗ.Колонки.Добавить(СоответствиеНаименованийСвойств[Свойство.Имя]);
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли; 
	
	СтрокиСНеНайденнымиЗначениями = Новый Массив;
	Для каждого ТекСтрокаXDTO Из СписокXDTO Цикл
		Если ТекСтрокаXDTO.WorkingHours = Неопределено Тогда
			Продолжить;			
		КонецЕсли; 
		СтрокаТЗ = ТЗ.Добавить();
		Для Каждого Колонка Из ТЗ.Колонки Цикл
			Реквизит = СоответствиеНаименованийСвойств[Колонка.Имя];
			гкс_ИнтеграцияXDTOАдаптер.ЗаполнитьРеквизитИзСвойстваXDTO(СтрокаТЗ[Колонка.Имя], ТекСтрокаXDTO, Реквизит);				
			Если Не ЗначениеЗаполнено(СтрокаТЗ[Колонка.Имя]) Тогда
				 СтрокиСНеНайденнымиЗначениями.Добавить(СтрокаТЗ);
				 Прервать;
			КонецЕсли; 
		КонецЦикла;
	КонецЦикла;
	Для каждого СтрокаКУдалению Из СтрокиСНеНайденнымиЗначениями Цикл
		ТЗ.Удалить(СтрокаКУдалению);		
	КонецЦикла; 
	
	Возврат ТЗ;
		
КонецФункции    

//Приемник - ОбъектXDTO
//Источник - Структура
Процедура ЗаполнитьЗначенияСвойствXDTO(Приемник, Знач Источник, СписокСвойств = Неопределено, ИсключаяСвойства="") Экспорт 
	
	Если ТипЗнч(СписокСвойств) = Тип("Строка") Тогда
		ЗаполняемыеСвойства = Новый Структура(СписокСвойств);
		
	ИначеЕсли ТипЗнч(СписокСвойств) = Тип("Структура") Тогда
		ЗаполняемыеСвойства = СписокСвойств;
		
	ИначеЕсли ТипЗнч(СписокСвойств) = Тип("СписокXDTO") Тогда	
		ЗаполняемыеСвойства = Новый Структура;
		Для Каждого Элемент Из СписокСвойств Цикл
			ЗаполняемыеСвойства.Вставить(Элемент);
		КонецЦикла;	
		
	Иначе
		ЗаполняемыеСвойства = Новый Структура;
	КонецЕсли;

	ИсключаемыеСвойства = Новый Структура(ИсключаяСвойства);
	
	Для каждого КлючИЗначение Из Источник Цикл
		
		Если ЗаполняемыеСвойства.Количество() > 0 И НЕ ЗаполняемыеСвойства.Свойство(КлючИЗначение.Ключ) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИсключаемыеСвойства.Количество() > 0 И ИсключаемыеСвойства.Свойство(КлючИЗначение.Ключ) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда 
			Приемник[КлючИЗначение.Ключ] = ПолучитьЗначениеXDTO(КлючИЗначение.Значение);
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьЗначениеXDTO(Значение, ТолькоСсылка =  Ложь) Экспорт
	
	Результат = Неопределено;
	
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Значение)) Тогда 
		
		Если ТолькоСсылка Тогда
			Результат = ПолучитьObjectIDпоСсылке(Значение);
		Иначе
			МетаданныеЗначения = Значение.Метаданные();
			ИмяТипаXDTO = ПолучитьИмяТипаXDTO(МетаданныеЗначения.ПолноеИмя());
			Результат = СоздатьОбъект(ИмяТипаXDTO);
			Результат.name     = Строка(Значение);
			Результат.ObjectID = ПолучитьObjectIDпоСсылке(Значение);
			Если ИмяТипаXDTO = "ASCompany" Тогда
				Результат.CodeInn = Значение.ИНН;				
			КонецЕсли; 
			
		КонецЕсли;
		
	Иначе	
		Результат = Значение;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьИмяТипаXDTO(ПолноеИмя) Экспорт
	
	ТаблицаСоответствия = СоответствиеТипов();
	Строка = ТаблицаСоответствия.Найти(ПолноеИмя, "ИмяТипа");
	Если Строка = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат Строка.ИмяXDTO;
	
КонецФункции

Функция ПолучитьObjectIDпоСсылке(Ссылка) Экспорт
	
	ОбъектИД      = СоздатьОбъект("ASObjectID");
	ОбъектИД.id   = ПолучитьIDПоСсылке(Ссылка);
	ОбъектИД.type = ПолучитьИмяТипаXDTO(Ссылка.Метаданные().ПолноеИмя());
	
	Возврат ОбъектИД;
	
КонецФункции

Функция ПолучитьIDПоСсылке(Ссылка)
	
	Если Ссылка.Пустая() Тогда 
		Возврат "";
	КонецЕсли;	
	
	Если ОбщегоНазначения.ЭтоПеречисление(Ссылка.Метаданные()) Тогда
		Возврат ОбщегоНазначения.ИмяЗначенияПеречисления(Ссылка);
	Иначе	
		Возврат Строка(Ссылка.УникальныйИдентификатор());
	КонецЕсли;		
	
КонецФункции 

// Проверяет тип объекта XDTO
//
// Параметры:
//   ОбъектXDTO - ОбъектXDTO - проверяемый объект
//   Тип - Строка - имя типа XDTO
// Возвращаемое значение:
//   Булево - Истина, если объект является объектом указанного типа
//
Функция ПроверитьТип(ОбъектXDTO, Тип, ПространствоИмен) Экспорт
	
	Возврат (ТипЗнч(ОбъектXDTO) = Тип("ОбъектXDTO"))
		И (ОбъектXDTO.Тип() = ФабрикаXDTO.Тип(ПространствоИмен, Тип));
	
КонецФункции	

// Создает XDTO объект указанного типа из пространства имен "http://www.1c.ru/dm"
// 
// Параметры:
//   ТипОбъекта - Строка - имя типа XDTO
// Возвращаемое значение:
//   ОбъектXDTO - созданный объект указанного типа
//
Функция СоздатьОбъект(ТипОбъекта) Экспорт
	
	Возврат ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(Метаданные.ПакетыXDTO.гкс_AsynxExchangeServices.ПространствоИмен, ТипОбъекта));
	
КонецФункции

Функция СериализоватьИзXDTO(Объект) Экспорт
	
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку("UTF-8");
	Запись.ЗаписатьОбъявлениеXML();

	ФабрикаXDTO.ЗаписатьXML(Запись, Объект, , , , НазначениеТипаXML.Явное);
	
	Возврат Запись.Закрыть();
	
КонецФункции

Функция СоответствиеТипов() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ИмяXDTO", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ИмяТипа",	Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ИспользоватьМенеджер",	Новый ОписаниеТипов("Булево"));
	
	//добавление соответствий типов
	ДобавитьСтроку(Таблица, "ASCompany", 				"Справочник.Организации");
	ДобавитьСтроку(Таблица, "ASCostCenter", 			"Справочник.СтруктураПредприятия");
	
	Возврат Таблица;
	
КонецФункции     

Процедура ДобавитьСтроку(Таблица, ИмяXDTO, ИмяТипа,ИспользоватьМенеджер = Ложь)
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ИмяXDTO = ИмяXDTO;
	НоваяСтрока.ИмяТипа = ИмяТипа;
	НоваяСтрока.ИспользоватьМенеджер = ИспользоватьМенеджер;
	
КонецПроцедуры

Процедура ДобавитьЗапросВЛог(Данные, Настройки, Ответ, НачалоЗапроса)
	
	ЗаписьЛога = Новый Структура;
			
	ЗаписьЛога.Вставить("Ответ", Ответ);
	ЗаписьЛога.Вставить("Запрос", Данные);
	ЗаписьЛога.Вставить("Метод", Настройки["Метод"]);
	ЗаписьЛога.Вставить("ИмяСервиса", Настройки["Очередь"]);
	ЗаписьЛога.Вставить("Длительность", (ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоЗапроса) / 1000);
	
	гкс_АсинхронныеСервисыВызовСервера.ЗаписатьВЛог(ЗаписьЛога);
		
КонецПроцедуры

#КонецОбласти
